/*
Заполнение небольших словарей
+authorization_types;
+image_types;
+video_types;
+movie_types;
+genres;
+person_positions;
*/

INSERT INTO authorization_types (name)
VALUES
  ('Логин, пароль'),
  ('ВКонтакте'),
  ('ЯндексID'),
  ('СМС');

INSERT INTO image_types (type_name)
VALUES
  ('Аватар'),
  ('Постер'),
  ('Портрет'),
  ('Кадр'),
  ('Обложка'),
  ('Фан-арт');

INSERT INTO video_types (type_name)
VALUES
  ('Основное видео'),
  ('Трейлер'),
  ('Фрагмент'),
  ('Тизер');

INSERT INTO movie_types (type_name)
VALUES
  ('Полнометражный фильм'),
  ('Короткометражный фильм'),
  ('Многосерийный фильм'),
  ('Сериал');

INSERT INTO genres (genre_name)
VALUES
  ('Комедия'),
  ('Мультфильм'),
  ('Ужасы'),
  ('Фантастика'),
  ('Триллер'),
  ('Боевик'),
  ('Мелодрама'),
  ('Детектив'),
  ('Приключения'),
  ('Фэнтези'),
  ('Военный'),
  ('Семейный'),
  ('Аниме'),
  ('Исторический'),
  ('Драма'),
  ('Документальный'),
  ('Детский'),
  ('Криминал'),
  ('Биография'),
  ('Вестерн'),
  ('Фильм-нуар'),
  ('Спортивный'),
  ('Реальное ТВ'),
  ('Короткометражка'),
  ('Музыкальный'),
  ('Мюзикл'),
  ('Ток-шоу'),
  ('Игры');

INSERT INTO person_positions (position_name)
VALUES
  ('Актер'),
  ('Режисер'),
  ('Продюсер'),
  ('Оператор'),
  ('Художник'),
  ('Гример'),
  ('Каскадер'),
  ('Художник по костюмам'),
  ('Светооператор'),
  ('Консультант');